In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
    "name": ['Sambhav', 'Sarthak', 'Rohan'],
    "marks": [86, 95, 64]
}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

      name  marks
0  Sambhav     86
1  Sarthak     95
2    Rohan     64

In [5]:
df.to_csv('exported_data.csv')

In [7]:
df.to_csv('exported_data.csv', index = False)

In [8]:
df

      name  marks
0  Sambhav     86
1  Sarthak     95
2    Rohan     64

In [10]:
df.describe()

           marks
count   3.000000
mean   81.666667
std    15.947832
min    64.000000
25%    75.000000
50%    86.000000
75%    90.500000
max    95.000000

In [11]:
your_df = pd.read_csv('exported_data.csv')

In [12]:
your_df

      name  marks
0  Sambhav     86
1  Sarthak     95
2    Rohan     64

In [14]:
your_df['marks'][0] = 88

<ipython-input-14-d1a98111154c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  your_df['marks'][0] = 88

In [15]:
your_df

      name  marks
0  Sambhav     88
1  Sarthak     95
2    Rohan     64